[net]
height=28
width=28
channels=1

[convolutional]
filters=20
size=5
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[convolutional]
filters=50
size=5
stride=1
pad=1
activation=relu

[maxpool]
size=2
stride=2

[connected]
output=500
activation=relu

[connected]
output=10
activation=linear

[softmax]

